<template>
  <div class="text-4xl text-center my-6">请选择性能测试项目</div>

  <div class="order-creation">
    <el-card class="box-card" @click="navigateTo('sort-test')">
      <div class="icon-container">
        <svg t="1716532583118" class="icon" viewBox="0 0 1028 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="2680" id="mx_n_1716532583119" width="200" height="200">
          <path
            d="M868.1 871.8c-8.4 0-16.9-3-23.6-9.1-14.3-13-15.3-35.2-2.3-49.4 74.6-81.9 115.7-188.1 115.7-299 0-244.8-199.2-444-444-444S70 269.5 70 514.3c0 101.7 33.4 197.3 96.7 276.6 12.1 15.1 9.6 37.1-5.5 49.2-15.1 12.1-37.1 9.6-49.2-5.5-35.6-44.6-63.2-94.3-82.3-147.7C10 631.6 0 573.5 0 514.3c0-69.4 13.6-136.7 40.4-200.1 25.9-61.2 63-116.2 110.1-163.4 47.2-47.2 102.2-84.3 163.4-110.1C377.3 13.9 444.6 0.3 514 0.3s136.7 13.6 200.1 40.4c61.2 25.9 116.2 62.9 163.4 110.1C924.6 198 961.7 253 987.6 314.2c26.8 63.4 40.4 130.7 40.4 200.1 0 128.4-47.6 251.3-134 346.1-6.9 7.6-16.4 11.4-25.9 11.4z"
            p-id="2681" fill="#ffffff"></path>
          <path
            d="M681.3 492.8c0.1-0.2 0.2-0.3 0.2-0.5 36.6-76.2 40.7-216.6-1.6-236.9-4.1-2-8.8-2.9-14-2.9-48.1 0-138.1 79.1-171.9 147.5-98.9 10-176 93.5-176 195 0 108.2 87.8 196 196 196s196-87.8 196-196c0-34.2-8.8-66.4-24.2-94.4-1.5-2.7-3-5.2-4.5-7.8z m-78.2 191.3C579.3 707.9 547.7 721 514 721s-65.3-13.1-89.1-36.9C401.1 660.3 388 628.7 388 595s13.1-65.3 36.9-89.1c23.8-23.8 55.4-36.9 89.1-36.9 22.7 0 44.9 6.1 64.2 17.6 4.5 2.7 8.9 5.7 13.1 8.9 13.7 10.6 24.8 23.7 33.2 38.8C634.8 553 640 573.4 640 595c0 33.7-13.1 65.3-36.9 89.1z"
            p-id="2682" fill="#ffffff"></path>
        </svg>
      </div>
      <div slot="header" class="clearfix">
        <span>订单排序测试</span>
      </div>
      <div class="hint">
        测试单次订单排序耗时<br>和订单排序时间更新间隔
      </div>
    </el-card>

    <el-card class="box-card" @click="navigateTo('relate-test')">
      <div class="icon-container">
        <svg t="1716532583118" class="icon" viewBox="0 0 1028 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="2680" id="mx_n_1716532583119" width="200" height="200">
          <path
            d="M868.1 871.8c-8.4 0-16.9-3-23.6-9.1-14.3-13-15.3-35.2-2.3-49.4 74.6-81.9 115.7-188.1 115.7-299 0-244.8-199.2-444-444-444S70 269.5 70 514.3c0 101.7 33.4 197.3 96.7 276.6 12.1 15.1 9.6 37.1-5.5 49.2-15.1 12.1-37.1 9.6-49.2-5.5-35.6-44.6-63.2-94.3-82.3-147.7C10 631.6 0 573.5 0 514.3c0-69.4 13.6-136.7 40.4-200.1 25.9-61.2 63-116.2 110.1-163.4 47.2-47.2 102.2-84.3 163.4-110.1C377.3 13.9 444.6 0.3 514 0.3s136.7 13.6 200.1 40.4c61.2 25.9 116.2 62.9 163.4 110.1C924.6 198 961.7 253 987.6 314.2c26.8 63.4 40.4 130.7 40.4 200.1 0 128.4-47.6 251.3-134 346.1-6.9 7.6-16.4 11.4-25.9 11.4z"
            p-id="2681" fill="#ffffff"></path>
          <path
            d="M681.3 492.8c0.1-0.2 0.2-0.3 0.2-0.5 36.6-76.2 40.7-216.6-1.6-236.9-4.1-2-8.8-2.9-14-2.9-48.1 0-138.1 79.1-171.9 147.5-98.9 10-176 93.5-176 195 0 108.2 87.8 196 196 196s196-87.8 196-196c0-34.2-8.8-66.4-24.2-94.4-1.5-2.7-3-5.2-4.5-7.8z m-78.2 191.3C579.3 707.9 547.7 721 514 721s-65.3-13.1-89.1-36.9C401.1 660.3 388 628.7 388 595s13.1-65.3 36.9-89.1c23.8-23.8 55.4-36.9 89.1-36.9 22.7 0 44.9 6.1 64.2 17.6 4.5 2.7 8.9 5.7 13.1 8.9 13.7 10.6 24.8 23.7 33.2 38.8C634.8 553 640 573.4 640 595c0 33.7-13.1 65.3-36.9 89.1z"
            p-id="2682" fill="#ffffff"></path>
        </svg>
      </div>
      <div slot="header" class="clearfix">
        <span>订单组合与统筹测试</span>
      </div>
      <div class="hint">
        测试订单组合统筹时间
      </div>
    </el-card>

    <el-card class="box-card" @click="navigateTo('statistics-test')">
      <div class="icon-container">
        <svg t="1716532583118" class="icon" viewBox="0 0 1028 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
          p-id="2680" id="mx_n_1716532583119" width="200" height="200">
          <path
            d="M868.1 871.8c-8.4 0-16.9-3-23.6-9.1-14.3-13-15.3-35.2-2.3-49.4 74.6-81.9 115.7-188.1 115.7-299 0-244.8-199.2-444-444-444S70 269.5 70 514.3c0 101.7 33.4 197.3 96.7 276.6 12.1 15.1 9.6 37.1-5.5 49.2-15.1 12.1-37.1 9.6-49.2-5.5-35.6-44.6-63.2-94.3-82.3-147.7C10 631.6 0 573.5 0 514.3c0-69.4 13.6-136.7 40.4-200.1 25.9-61.2 63-116.2 110.1-163.4 47.2-47.2 102.2-84.3 163.4-110.1C377.3 13.9 444.6 0.3 514 0.3s136.7 13.6 200.1 40.4c61.2 25.9 116.2 62.9 163.4 110.1C924.6 198 961.7 253 987.6 314.2c26.8 63.4 40.4 130.7 40.4 200.1 0 128.4-47.6 251.3-134 346.1-6.9 7.6-16.4 11.4-25.9 11.4z"
            p-id="2681" fill="#ffffff"></path>
          <path
            d="M681.3 492.8c0.1-0.2 0.2-0.3 0.2-0.5 36.6-76.2 40.7-216.6-1.6-236.9-4.1-2-8.8-2.9-14-2.9-48.1 0-138.1 79.1-171.9 147.5-98.9 10-176 93.5-176 195 0 108.2 87.8 196 196 196s196-87.8 196-196c0-34.2-8.8-66.4-24.2-94.4-1.5-2.7-3-5.2-4.5-7.8z m-78.2 191.3C579.3 707.9 547.7 721 514 721s-65.3-13.1-89.1-36.9C401.1 660.3 388 628.7 388 595s13.1-65.3 36.9-89.1c23.8-23.8 55.4-36.9 89.1-36.9 22.7 0 44.9 6.1 64.2 17.6 4.5 2.7 8.9 5.7 13.1 8.9 13.7 10.6 24.8 23.7 33.2 38.8C634.8 553 640 573.4 640 595c0 33.7-13.1 65.3-36.9 89.1z"
            p-id="2682" fill="#ffffff"></path>
        </svg>
      </div>
      <div slot="header" class="clearfix">
        <span>需求统计与预测测试</span>
      </div>
      <div class="hint">
        测试需求统计与预测<br>算法的耗时
      </div>
    </el-card>
  </div>
</template>

<script setup>
import { useRouter } from 'vue-router';
import { useUserStore } from "@/store/user";
import { storeToRefs } from "pinia"
const navigateTo = (test) => {
  router.push(`/${test}`);
};

</script>

<style scoped lang="less">
.order-creation {
  display: flex;
  justify-content: space-around;
  align-items: center;
  flex-direction: row;
  text-align: center;
  flex-wrap: wrap;
}

.box-card {
  width: 450px;
  height: 600px; // 设置卡片的高度
  margin: 20px auto;
  padding: 30px; // 增大内边距
  background: rgba(255, 255, 255, 0.1);
  background-clip: padding-box;
  box-decoration-break: clone;
  border: 1px solid rgba(255, 255, 255, 0.3);
  border-radius: 15px;
  box-shadow: 0 8px 16px 0 rgba(0, 0, 0, 0.2);
  transition: box-shadow 0.3s ease;
  cursor: pointer;

  &:hover {
    box-shadow: 0 0 30px 10px rgba(255, 255, 255, 0.5);

  }
}

.icon-container {
  display: flex;
  justify-content: center;
  align-items: center;
}

.icon-container svg {
  margin-bottom: 30px;
}

.clearfix {
  font-size: 2.5em;
  font-family: 'AliHYAiHei';
  font-weight: bold;
  color: #fff;
  margin-bottom: 30px;
}

.hint {
  color: #a1a1a1;
  font-size: 2em;
  line-height: 1.5;
}
</style>